#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=real-state-java-services-ecs-task-execution-role-dev]
data.aws_caller_identity.current: Reading...
aws_cloudwatch_log_group.srv_cad_company: Refreshing state... [id=/ecs/real-state-java-services-cluster-dev/srv-cad-company]
aws_ecr_repository.srv_cad_imoveis: Refreshing state... [id=srv-cad-imoveis]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:665290616424:cluster/real-state-java-services-cluster-dev]
aws_iam_role.ecs_srv_cad_company_task_role: Refreshing state... [id=real-state-java-services-ecs-srv-cad-company-task-role-dev]
aws_iam_role.ecs_generic_task_role: Refreshing state... [id=real-state-java-services-ecs-generic-task-role-dev]
aws_ecr_repository.srv_cad_usuarios: Refreshing state... [id=srv-cad-usuarios]
aws_cloudwatch_log_group.srv_cad_imoveis: Refreshing state... [id=/ecs/real-state-java-services-cluster-dev/srv-cad-imoveis]
aws_ecr_repository.srv_cad_company: Refreshing state... [id=srv-cad-company]
data.aws_caller_identity.current: Read complete after 0s [id=665290616424]
aws_cloudwatch_log_group.srv_cad_usuarios: Refreshing state... [id=/ecs/real-state-java-services-cluster-dev/srv-cad-usuarios]
aws_vpc.main: Refreshing state... [id=vpc-026259f0239d72b5d]
data.aws_iam_policy_document.ecs_dynamodb_cad_company_access: Reading...
data.aws_iam_policy_document.ecs_dynamodb_cad_company_access: Read complete after 0s [id=4048910599]
aws_iam_policy.ecs_dynamodb_cad_company_access: Refreshing state... [id=arn:aws:iam::665290616424:policy/real-state-java-services-ecs-dynamodb-cad-company-policy-dev]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=real-state-java-services-ecs-task-execution-role-dev-20250606211243339300000001]
aws_ecs_task_definition.srv_cad_usuarios: Refreshing state... [id=srv-cad-usuarios-dev]
aws_ecs_task_definition.srv_cad_company: Refreshing state... [id=srv-cad-company-dev]
aws_ecs_task_definition.srv_cad_imoveis: Refreshing state... [id=srv-cad-imoveis-dev]
aws_iam_role_policy_attachment.ecs_srv_cad_company_dynamodb_access: Refreshing state... [id=real-state-java-services-ecs-srv-cad-company-task-role-dev-20250606211243577200000002]
aws_internet_gateway.gw: Refreshing state... [id=igw-0ff4a3133dd176f6d]
aws_subnet.private[0]: Refreshing state... [id=subnet-0bf3dd77b7b48d34f]
aws_lb_target_group.srv_cad_usuarios: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:targetgroup/srv-cad-usuarios-dev/d64b4e94cb2f985e]
aws_security_group.alb_sg: Refreshing state... [id=sg-0f38edbcb76b268e4]
aws_subnet.public[1]: Refreshing state... [id=subnet-0f531427108eff4c9]
aws_lb_target_group.srv_cad_company: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:targetgroup/srv-cad-company-dev/ada4cdf402d34335]
aws_lb_target_group.srv_cad_imoveis: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:targetgroup/srv-cad-imoveis-dev/b8a6774cc483a793]
aws_subnet.public[0]: Refreshing state... [id=subnet-0a209d5d06d6dd70b]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a84e48474a9f3846]
aws_eip.nat: Refreshing state... [id=eipalloc-0a363965007ebc48b]
aws_route_table.public: Refreshing state... [id=rtb-09b0f91e9c7a50430]
aws_security_group.ecs_tasks_sg: Refreshing state... [id=sg-0f1e21fa68e3ba7fd]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0015168a5d42e3a03]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f12d0d8dd92ffa7d]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:loadbalancer/app/real-state-java-services-alb-dev/0cf0c6c6d1d18989]
aws_ecs_service.srv_cad_company: Refreshing state... [id=arn:aws:ecs:us-east-1:665290616424:service/real-state-java-services-cluster-dev/srv-cad-company-dev]
aws_ecs_service.srv_cad_imoveis: Refreshing state... [id=arn:aws:ecs:us-east-1:665290616424:service/real-state-java-services-cluster-dev/srv-cad-imoveis-dev]
aws_ecs_service.srv_cad_usuarios: Refreshing state... [id=arn:aws:ecs:us-east-1:665290616424:service/real-state-java-services-cluster-dev/srv-cad-usuarios-dev]
aws_nat_gateway.nat: Refreshing state... [id=nat-0779c2af01bfd9096]
aws_route_table.private: Refreshing state... [id=rtb-04945704bf3cf399e]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0618be685e71910ad]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08df193badd0f3eb0]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:listener/app/real-state-java-services-alb-dev/0cf0c6c6d1d18989/d599128400770b0a]
aws_lb_listener_rule.srv_cad_company: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:listener-rule/app/real-state-java-services-alb-dev/0cf0c6c6d1d18989/d599128400770b0a/0f01746436c1ef28]
aws_lb_listener_rule.srv_cad_imoveis: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:listener-rule/app/real-state-java-services-alb-dev/0cf0c6c6d1d18989/d599128400770b0a/42f22630bbf7fbf0]
aws_lb_listener_rule.srv_cad_usuarios: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:665290616424:listener-rule/app/real-state-java-services-alb-dev/0cf0c6c6d1d18989/d599128400770b0a/3c3275e2a588272c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.srv_cad_usuarios will be updated in-place
  ~ resource "aws_ecs_service" "srv_cad_usuarios" {
        id                                 = "arn:aws:ecs:us-east-1:665290616424:service/real-state-java-services-cluster-dev/srv-cad-usuarios-dev"
        name                               = "srv-cad-usuarios-dev"
        tags                               = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "real-state-java-services"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:665290616424:task-definition/srv-cad-usuarios-dev:9" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.srv_cad_usuarios must be replaced
-/+ resource "aws_ecs_task_definition" "srv_cad_usuarios" {
      ~ arn                      = "arn:aws:ecs:us-east-1:665290616424:task-definition/srv-cad-usuarios-dev:7" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:665290616424:task-definition/srv-cad-usuarios-dev" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "srv-cad-usuarios-dev" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
        tags                     = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "real-state-java-services"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_lb_target_group.srv_cad_usuarios will be updated in-place
  ~ resource "aws_lb_target_group" "srv_cad_usuarios" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:665290616424:targetgroup/srv-cad-usuarios-dev/d64b4e94cb2f985e"
        name                               = "srv-cad-usuarios-dev"
        tags                               = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "real-state-java-services"
        }
        # (18 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/srv-cad-usuarios/actuator/health" -> "/srv-cad-usuarios/health"
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>